nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    chkBox[1].Checked = config.inet2rf;
    chkBox[1].x = 60;
    chkBox[1].y = 18;
    sprintf(chkBox[1].text, "INET2RF");

    chkBox[2].Checked = false;
    chkBox[2].x = 0;
    chkBox[2].y = 29;
    sprintf(chkBox[2].text, "TLM");

    display.setCursor(35, 30);
    display.print("INTERVAL");
    cbBox[0].isValue = true;
    cbBox[0].x = 85;
    cbBox[0].y = 28;
    cbBox[0].length = 4;
    cbBox[0].char_max = 1800;
    cbBox[0].SetIndex(0);

    display.setCursor(0, 42);
    display.print("PTH:");
    cbBox[1].isValue = false;
    cbBox[1].x = 20;
    cbBox[1].y = 40;
    cbBox[1].length = 13;
    int sel = 0;
    cbBox[1].maxItem(4);
    for (i = 0; i < 4; i++)
    {
        cbBox[1].AddItem(i, config.path[i]);
        if (!strcmp(&config.igate_path[0], &config.path[i][0]))
            sel = i;
    }
    cbBox[1].SetIndex(sel);

    display.setCursor(0, 54);
    display.print("TXT:");
    txtBox.x = 20;
    txtBox.y = 52;
    txtBox.length = 14;
    txtBox.type = ALL;
    strcpy(txtBox.text, config.igate_comment);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;

            for (i = 0; i < 3; i++)
                chkBox[i].isSelect = false;
            cbBox[0].isSelect = false;
            cbBox[1].isSelect = false;
            txtBox.isSelect = false;

            if (encoder0Pos < 3)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 3)
                cbBox[0].isSelect = true;
            if (encoder0Pos == 4)
                cbBox[1].isSelect = true;
            if (encoder0Pos == 5)
                txtBox.isSelect = true;
            for (i = 0; i < 3; i++)
                chkBox[i].CheckBoxShow();
            cbBox[0].Show();
            cbBox[1].Show();
            txtBox.TextBoxShow();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 5)
                {
                    txtBox.TextBox();
                    strcpy(config.igate_comment, txtBox.text);
                    encoder0Pos = keyPrev;
                }
                else if (i == 4)
                {
                    cbBox[1].SelectItem();
                    int n = cbBox[1].GetIndex();
                    if (n < 4)
                    {
                        strcpy(config.igate_path, config.path[n]);
                    }
                    encoder0Pos = keyPrev;
                    cbBox[1].Show();
                }
                else if (i == 3)
                {
                    cbBox[0].SelectValue(0, 1800, 60);
                    //config.igate_tlm_interval = cbBox[0].GetValue();
                    encoder0Pos = keyPrev;
                    cbBox[0].Show();
                }
                else
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.rf2inet = chkBox[i].Checked;
                        break;
                    case 1:
                        config.inet2rf = chkBox[i].Checked;
                        break;
                    case 2:
                        //config.igate_tlm = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_igate_beacon_selected(MenuItem *p_menu_item)
{
    int max_sel = 6;
    MyTextBox txtBox[2];
    MyCheckBox chkBox[3];
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=IGATE BEACON=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBox[0].Checked = config.igate_bcn;
    chkBox[0].x = 0;
    chkBox[0].y = 18;
    sprintf(chkBox[0].text, "BCN");

    chkBox[1].Checked = config.igate_loc2rf;
    chkBox[1].x = 0;
    chkBox[1].y = 30;
    sprintf(chkBox[1].text, "POS2RF");

    chkBox[2].Checked = config.igate_loc2inet;
    chkBox[2].x = 60;
    chkBox[2].y = 30;
    sprintf(chkBox[2].text, "POS2INET");

    display.setCursor(35, 20);
    display.print("INTERVAL");
    cbBox.isValue = true;
    cbBox.x = 85;
    cbBox.y = 18;
    cbBox.length = 4;
    cbBox.char_max = 1800;
    cbBox.SetIndex(config.igate_interval);

    display.setCursor(0, 42);
    display.print("OBJECT");
    txtBox[0].x = 40;
    txtBox[0].y = 40;
    txtBox[0].length = 11;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.igate_object);

    display.setCursor(0, 54);
    display.print("PHG");
    txtBox[1].x = 20;
    txtBox[1].y = 52;
    txtBox[1].length = 6;
    txtBox[1].type = 0;
    strcpy(txtBox[1].text, config.igate_phg);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 3; i++)
                chkBox[i].isSelect = false;
            cbBox.isSelect = false;
            txtBox[0].isSelect = false;
            txtBox[1].isSelect = false;

            if (encoder0Pos == 0)
                chkBox[0].isSelect = true;
            if (encoder0Pos == 2)
                chkBox[1].isSelect = true;
            if (encoder0Pos == 3)
                chkBox[2].isSelect = true;
            if (encoder0Pos == 1)
                cbBox.isSelect = true;
            if (encoder0Pos == 4)
                txtBox[0].isSelect = true;
            if (encoder0Pos == 5)
                txtBox[1].isSelect = true;
            for (i = 0; i < 3; i++)
                chkBox[i].CheckBoxShow();
            cbBox.Show();
            txtBox[0].TextBoxShow();
            txtBox[1].TextBoxShow();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 5)
                {
                    txtBox[1].TextBox();
                    strcpy(config.igate_phg, txtBox[1].text);
                    encoder0Pos = keyPrev;
                }
                else if (i == 4)
                {
                    txtBox[0].TextBox();
                    strcpy(config.igate_object, txtBox[0].text);
                    encoder0Pos = keyPrev;
                }
                else if (i == 1)
                {
                    cbBox.SelectValue(0, 1800, 60);
                    config.igate_interval = cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                else
                {

                    switch (i)
                    {
                    case 0:
                        chkBox[0].Toggle();
                        config.igate_bcn = chkBox[0].Checked;
                        chkBox[0].CheckBoxShow();
                        break;
                    case 2:
                        chkBox[1].Toggle();
                        config.igate_loc2rf = chkBox[1].Checked;
                        chkBox[1].CheckBoxShow();
                        break;
                    case 3:
                        chkBox[2].Toggle();
                        config.igate_loc2inet = chkBox[2].Checked;
                        chkBox[2].CheckBoxShow();
                        break;
                    }
                    encoder0Pos = keyPrev;
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_tracker_position_selected(MenuItem *p_menu_item)
{
    int max_sel = 7;
    MyTextBox txtBox[3];
    MySymbolBox symBox;
    MyCheckBox chkGPS, chkSMBeacon;
    MyComboBox cbBox;
    String str;
    char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("TRACKER POSITION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("MyCall:");
    txtBox[0].x = 41;
    txtBox[0].y = 16;
    txtBox[0].length = 7;
    txtBox[0].type = 0;
    str = String(config.trk_mycall);
    str.toUpperCase();
    str.toCharArray(&ch[0], 10);
    strcpy(txtBox[0].text, ch);

    display.setCursor(95, 18);
    display.print("-");
    cbBox.isValue = true;
    cbBox.x = 101;
    cbBox.y = 16;
    cbBox.length = 2;
    cbBox.maxItem(15);
    cbBox.char_max = 15;
    cbBox.SetIndex(config.trk_ssid);

    display.setCursor(0, 30);
    display.print("LAT:");
    txtBox[1].x = 26;
    txtBox[1].y = 28;
    txtBox[1].length = 8;
    txtBox[1].type = 1;
    sprintf(txtBox[1].text, "%.5f", config.trk_lat);

    display.setCursor(0, 42);
    display.print("LON:");
    // TextBoxShow(&mylon[0], 26, 40,9);
    txtBox[2].x = 26;
    txtBox[2].y = 40;
    txtBox[2].length = 9;
    txtBox[2].type = 1;
    sprintf(txtBox[2].text, "%.5f", config.trk_lon);

