nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    // rotaryEncoder.areEncoderPinsPulldownforEsp32 = false;
    // rotaryEncoder.begin();
    // rotaryEncoder.setup(readEncoderISR);
    // rotaryEncoder.setBoundaries(1, 5, true); // minValue, maxValue, circleValues true|false (when max go to min and vice versa)
    // rotaryEncoder.setAcceleration(250);

    // pinMode(keyA, INPUT_PULLUP);
    // pinMode(keyB, INPUT_PULLUP);

    // topBar(-100);
    conStatNetwork = CON_WIFI;
    conStat = CON_NORMAL;

    // showDisp=false;
    curTab = 3;
    // oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    mnuAbout.add_item(&mnuAbout_mi1);
    mnuAbout.add_item(&mnuAbout_mi2);
    mnuAbout.add_item(&mnuAbout_mi3);
    mnuAbout.add_item(&mnuAbout_mi4);
    // ms.get_root_menu().add_menu(&mnuConfig); //Wiress
    mnuConfig.add_item(&mnuConfig_mi1);
    mnuConfig.add_item(&mnuConfig_mi2);
    mnuConfig.add_item(&mnuConfig_mi3);
    mnuConfig.add_item(&mnuConfig_mi4);

    ms.get_root_menu().add_menu(&mnu1); // Wiress
    mnu1.add_item(&mnu1_mi1);
    mnu1.add_item(&mnu1_mi2);
    mnu1.add_item(&mnu1_mi3);
    mnu1.add_item(&mnu1_mi4);

    ms.get_root_menu().add_menu(&mnuAPRS); // APRS

    // ms.get_root_menu().add_menu(&mnu2); // IGATE
    mnuAPRS.add_menu(&mnu2);
    mnu2.add_item(&mnu2_mi1);
    mnu2.add_item(&mnu2_mi2);
    mnu2.add_item(&mnu2_mi3);
    mnu2.add_item(&mnu2_mi4);

    // ms.get_root_menu().add_menu(&mnu3); // TRACKER
    mnuAPRS.add_menu(&mnu3);
    mnu3.add_item(&mnu3_mi1);
    mnu3.add_item(&mnu3_mi2);
    mnu3.add_item(&mnu3_mi3);
    mnu3.add_item(&mnu3_mi4);

    // ms.get_root_menu().add_menu(&mnu4); // DIGI
    mnuAPRS.add_menu(&mnu4);
    mnu4.add_item(&mnu4_mi1);
    mnu4.add_item(&mnu4_mi2);
    mnu4.add_item(&mnu4_mi3);
    // mnu4.add_item(&mnu4_mi4);

    ms.get_root_menu().add_menu(&mnu5); // SYSTEM
    mnu5.add_menu(&mnuConfig);
    mnu5.add_item(&mnu5_mi2);
    mnu5.add_item(&mnu5_mi3);
    mnu5.add_menu(&mnuAbout);

    // ms.get_root_menu().add_menu(&mu1);
    // mu1.add_item(&mu1_mi1);
    // mu1.add_item(&mu1_mi2);
    // mu1.add_item(&mu1_mi3);
    // mu1.add_item(&mu1_mi4);
    // ms.get_root_menu().add_menu(&mu2);
    // mu2.add_item(&mu2_mi1);
    // mu2.add_item(&mu2_mi2);
    // mu2.add_item(&mu2_mi3);
    // mu2.add_item(&mu2_mi4);
    // mu2.add_item(&mu2_mi5);

    // ms.get_root_menu().add_menu(&mu6);
    // mu6.add_item(&mu6_mi0);
    // mu6.add_item(&mu6_mi1);
    // mu6.add_item(&mu6_mi2);
    // // mu6.add_item(&mu6_mi3);

    // ms.get_root_menu().add_menu(&mu5);
    // mu5.add_item(&mu5_mi1);
    // mu5.add_item(&mu5_mi2);
    // mu5.add_item(&mu5_mi3);

    // ms.get_root_menu().add_menu(&mu4);
    // mu4.add_item(&mu4_mi1);
    // mu4.add_item(&mu4_mi2);
    // mu4.add_item(&mu4_mi3);
    // mu4.add_item(&mu4_mi4);
    // //mu4.add_item(&mu4_mi5);
    // mu4.add_menu(&mu3);

    // // mu4.add_item(&mu4_mi6);
    // ms.get_root_menu().add_menu(&mu3);
    // mu3.add_item(&mu3_mi1);
    // mu3.add_item(&mu3_mi2);
    // mu3.add_item(&mu3_mi3);
    // mu3.add_item(&mu3_mi4);
    // // ms.display();

    // rotaryEncoder.enable();

    attachInterrupt(keyA, doEncoder, CHANGE);
    attachInterrupt(keyB, doEncoder, CHANGE);

    if (config.startup > 5)
        config.startup = 0;
    if (config.startup < 5)
    {
        curTab = config.startup + 1;
        gps_mode = 0;
    }
    else
    {
        curTab = 5;
        gps_mode = 1;
    }
    topBar(-1);

    if (config.igate_gps == false)
    {
        tx_counter = 0;
        tx_interval = 10;
    }

    unsigned long timeGuiOld = millis();
    timeGui = 0;
    saveTimeout = millis();
    for (;;)
    {
        unsigned long now = millis();
        timeGui = now - timeGuiOld;
        timeGuiOld = now;
        vTaskDelay(10 / portTICK_PERIOD_MS);

        if (millis() > (saveTimeout + 300000))
        {
            powerSave();
        }

        //Prevent RF interference with OLED
        if (getTransmit()){
            delay(100);
            continue;
        }

        if (conStat == CON_NORMAL)
        {
            menuTimeout = millis();
            //continue;
            // readSerialGPS();
            if ((raw_count > 0) && (disp_delay == 0))
            {
                saveTimeout = millis();
                dispPush = false;
                int idx=0;                
                if(popTNC2Raw(idx)>-1){
                    pkgListType pkg=getPkgList(idx);
                    rawDisp = String(pkg.raw);
                    dispWindow(rawDisp, dispMode, true);
                    selTab=idx;
                }
                // selTab = 1;
            }

            // if (!getTransmit())
            // {
                if (dispFlagTX == 1)
                {
                    dispTX(1);
                    dispFlagTX = 0;
                }
                else if (dispFlagTX == 2)
                {
                    dispTX(0);
                    dispFlagTX = 0;
                }
            //}

            if (millis() > (unsigned long)timeHalfSec)
            {
                timeHalfSec = millis() + 500 + disp_delay;
                // powerWakeup();
                disp_delay = 0;
                dispMode = 0;
                // dispFlagTX=0;
                if (powerStatus() && (raw_count == 0))
                {
                    if (!(curTab == 5 && gps_mode == 1))
                        topBar(WiFi.RSSI());
                    switch (curTab)
                    {
                    case 1:
                        statisticsDisp();
                        break;
                    case 2:
                        pkgLastDisp();
                        break;
                    case 3:
                        pkgCountDisp();
                        break;
                    case 4:
                        systemDisp();
                        break;
                    case 5:
                        gpsDisp();
                        break;
                    }
                }
            }
            else if (disp_delay > 0)
            {
                if (encoder0Pos != posNow)
                {
                    
                    saveTimeout = millis();
                    pkgListType pkg=getPkgList(selTab);
                    if (config.dim == 2)
                        dimTimeout = millis();
                    if (encoder0Pos > posNow)
                    {
                        selTab++;
                        for (; selTab < PKGLISTSIZE; selTab++)
                        {
                            if (pkg.time > 0)
                                break;
                        }
                        if (selTab >= PKGLISTSIZE)
                            selTab = 0;
                    }
                    else
                    {
                        selTab--;
                        for (; selTab >= 0; selTab--)
                        {
                            if (pkg.time > 0)
                                break;
                        }
                        if (selTab < 0)
                            selTab = PKGLISTSIZE - 1;
                    }
                    posNow = encoder0Pos;
                    
                    if (pkg.time > 0)
                    {
                        rawDisp = String(pkg.raw);
                        dispWindow(rawDisp, dispMode, false);
                    }
                }
            }

            if (raw_count == 0)
            {
                // lets see if anything changed
                // if (rotaryEncoder.encoderChanged() != 0)
                // {
                //     timeHalfSec = 0;
                //     powerWakeup();
                //     saveTimeout = millis();
                //     if (config.dim == 2)
                //         dimTimeout = millis();
                //     // now we need current value
                //     curTab = (char)rotaryEncoder.readEncoder();
                //     // process new value. Here is simple output.
                //     //  Serial.print("Value: ");
                //     //  Serial.println(curTab,DEC);
                // }
                if (encoder0Pos != posNow)
                {
                    timeHalfSec = 0;
                    powerWakeup();
                    saveTimeout = millis();
                    if (config.dim == 2)
                        dimTimeout = millis();
                    if (encoder0Pos > posNow)
                    {
                        curTab++;
                        if (curTab > 5)
                            curTab = 1;
                    }
                    else
                    {
                        curTab--;
                        if (curTab < 1)
                            curTab = 5;
                    }
                    posNow = encoder0Pos;
                }
            }
        }

        if ((digitalRead(keyPush) == LOW) && (conStat != CON_MENU))
        {
            saveTimeout = millis();
            powerWakeup();
            currentTime = millis();
            delay(500);
            // conStat = CON_MENU;
            // TaskGPS.Enable(false);
            if (digitalRead(keyPush) == HIGH)
            { // ONE Click
                if (config.dim == 2)
                    dimTimeout = millis();
                if (disp_delay > 0)
                { // Select MODE Decode/RAW
                    dispPush = false;
                    disp_delay = config.dispDelay * 1000;
                    timeHalfSec = millis() + disp_delay;
                    if (dispMode == 0)
                        dispMode = 1;
                    else
                        dispMode = 0;
                    dispWindow(rawDisp, dispMode, false);
                }
                else
                {
                    if (curTab == 2 || curTab == 3)
                    { // To Display mode.
                        dispMode = 0;
                        selTab = 0;
                        pkgListType pkg=getPkgList(selTab);
                        rawDisp = String(pkg.raw);
                        dispWindow(rawDisp, dispMode, false);
                        posNow = encoder0Pos;
                    }
                    else if (curTab == 1)
                    {
                        // EVENT_TX_POSITION = 1;
                        tx_counter = 10;
                    }
                    else if (curTab == 5)
                    {
                        if (gps_mode == 0)
                            gps_mode = 1;
                        else
                            gps_mode = 0;
                    }
                }
            }
            // ms.reset();
            // ms.display();
            while (digitalRead(keyPush) == LOW)
            {
                delay(10);
                if ((millis() - currentTime) > 2000)
                {
                    // if ((curTab == 2 || curTab == 3)&& disp_delay>0) {
                    if (disp_delay > 0)
                    {
                        dispPush = true;
                        disp_delay = 600 * 1000;
                        dispWindow(rawDisp, dispMode, false);
                    }
                    else
                    {
                        conStat = CON_MENU;
                        // TaskGPS.Enable(false);

