nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
void dispTX(bool port)
{
    //display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false);
    display.clearDisplay();
    // display.fillRect(0, 0, 128, 64, BLACK);
    disp_delay = 2000;
    timeHalfSec = millis() + disp_delay;
    // display.fillRect(0, 0, 128, 16, WHITE);
    const uint8_t *ptrSymbol;
    uint8_t symIdx = send_aprs_symbol - 0x21;
    if (symIdx > 95)
        symIdx = 0;
    if (send_aprs_table == '/')
    {
        ptrSymbol = &Icon_TableA[symIdx][0];
    }
    else if (send_aprs_table == '\\')
    {
        ptrSymbol = &Icon_TableB[symIdx][0];
    }
    else
    {
        if (send_aprs_table < 'A' || send_aprs_table > 'Z')
        {
            send_aprs_table = 'N';
            send_aprs_symbol = '&';
            symIdx = 5; // &
        }
        ptrSymbol = &Icon_TableB[symIdx][0];
    }
    display.drawYBitmap(0, 0, ptrSymbol, 16, 16, WHITE);
    if (!(send_aprs_table == '/' || send_aprs_table == '\\'))
    {
        display.drawChar(5, 4, send_aprs_table, BLACK, WHITE, 1);
        display.drawChar(6, 5, send_aprs_table, BLACK, WHITE, 1);
    }

    display.setFont(&FreeSansBold9pt7b);
    display.setCursor(20, 14);
    if (strlen(config.igate_object))
    {
        display.print(config.igate_object);
    }
    else
    {
        display.print(config.aprs_mycall);
        if (config.aprs_ssid > 0)
        {
            display.print("-");
            display.print(config.aprs_ssid);
        }
    }

    display.setFont(&FreeSerifItalic9pt7b);

    if (port == 0)
    {
        display.setCursor(5, 42);
        display.print("TCP");
        display.setCursor(15, 57);
        display.print("IP");
    }
    else
    {
        display.setCursor(3, 42);
        display.print("SEND");
        display.setCursor(15, 57);
        display.print("RF");
    }

    display.setFont();
    display.setTextColor(WHITE);
    // if (selTab < 10)
    //	display.setCursor(121, 0);
    // else
    display.setCursor(115, 0);
    display.print("TX");

    display.drawRoundRect(0, 16, 128, 48, 5, WHITE);
    display.fillRoundRect(1, 17, 126, 10, 2, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(40, 18);
    display.print("TX STATUS");

    display.setTextColor(WHITE);
    display.setCursor(50, 30);
    if (config.igate_gps)
    {
        display.printf("POSITION GPS");
        // display.setCursor(48, 39);
        // display.printf("HEADING %d", SB_HEADING);
        display.setCursor(50, 48);
        display.printf("SPD %dkPh/%d", SB_SPEED, SB_HEADING);
    }
    else
    {
        display.printf("POSITION FIX");
    }
    display.setCursor(50, 39);
    display.printf("INTERVAL %dS", tx_interval);
    // display.setCursor(48, 39);
    // display.printf("HEADING %d", SB_HEADING);
    // display.setCursor(48, 48);
    // display.printf("SPEED %dkm/h", SB_SPEED);

    display.display();
}

// char* directions[] = { "S", "SW", "W", "NW", "N", "NE", "E", "SE", "S" };
const char *directions[] = {"N", "NE", "E", "SE", "S", "SW", "W", "NW"};

void dispWindow(String line, uint8_t mode, bool filter)
{
    struct pbuf_t aprs;
    uint16_t bgcolor, txtcolor;
    bool Monitor = false;
    char text[200];
    unsigned char x = 0;
    char itemname[10];
    int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
    if (start_val > 3)
    {
        powerWakeup();
        // Serial.println(line);
        String src_call = line.substring(0, start_val);
        memset(&aprs, 0, sizeof(pbuf_t));
        aprs.buf_len = 300;
        aprs.packet_len = line.length();
        line.toCharArray(&aprs.data[0], aprs.packet_len);
        int start_info = line.indexOf(":", 0);
        int end_ssid = line.indexOf(",", 0);
        int start_dst = line.indexOf(">", 2);
        int start_dstssid = line.indexOf("-", start_dst);
        if ((start_dstssid > start_dst) && (start_dstssid < start_dst + 10))
        {
            aprs.dstcall_end_or_ssid = &aprs.data[start_dstssid];
        }
        else
        {
            aprs.dstcall_end_or_ssid = &aprs.data[end_ssid];
        }
        aprs.info_start = &aprs.data[start_info + 1];
        aprs.dstname = &aprs.data[start_dst + 1];
        aprs.dstname_len = end_ssid - start_dst;
        aprs.dstcall_end = &aprs.data[end_ssid];
        aprs.srccall_end = &aprs.data[start_dst];

        // Serial.println(aprs.info_start);
        // aprsParse.parse_aprs(&aprs);
        if (aprsParse.parse_aprs(&aprs))
        {
            if (filter == true)
            {
                if ((config.dispFilter&FILTER_STATUS) && (aprs.packettype & T_STATUS))
                {
                    Monitor = true;
                }
                else if ((config.dispFilter&FILTER_MESSAGE) && (aprs.packettype & T_MESSAGE))
                {
                    Monitor = true;
                }
                else if ((config.dispFilter&FILTER_TELEMETRY) && (aprs.packettype & T_TELEMETRY))
                {
                    Monitor = true;
                }
                else if ((config.dispFilter&FILTER_WX) && ((aprs.packettype & T_WX) || (aprs.packettype & T_WAVE)))
                {
                    Monitor = true;
                }

                if ((config.dispFilter&FILTER_POSITION) && (aprs.packettype & T_POSITION))
                {
                    double lat, lon;
                    if (gps.location.isValid())
                    {
                        lat = gps.location.lat();
                        lon = gps.location.lng();
                    }
                    else
                    {
                        lat = config.igate_lat;
                        lon = config.igate_lon;
                    }
                    double dist = aprsParse.distance(lon, lat, aprs.lng, aprs.lat);
                    if (config.filterDistant == 0)
                    {
                        Monitor = true;
                    }
                    else
                    {
                        if (dist < config.filterDistant)
                            Monitor = true;
                        else
                            Monitor = false;
                    }
                }

